>>SOURCE FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. COUSR00C.
AUTHOR. AWS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-MODE PIC X VALUE "L".

LINKAGE SECTION.
01 CARDDEMO-COMMAREA.
   05 CDEMO-GENERAL-INFO.
      10 CDEMO-FROM-TRANID             PIC X(04).
      10 CDEMO-FROM-PROGRAM            PIC X(08).
      10 CDEMO-TO-TRANID               PIC X(04).
      10 CDEMO-TO-PROGRAM              PIC X(08).
      10 CDEMO-USER-ID                 PIC X(08).
      10 CDEMO-USER-TYPE               PIC X(01).
      10 CDEMO-PGM-CONTEXT             PIC 9(01).
   05 FILLER                           PIC X(120).

PROCEDURE DIVISION USING CARDDEMO-COMMAREA.
    CALL "GCUSRSEC" USING CARDDEMO-COMMAREA WS-MODE
    GOBACK.
